'use client'

import React, { useState, useEffect } from 'react'

export default function SectionOne({ page }: { page: any }) {
  return (
    <section className="grid grid-cols-2 gap-5 items-center justify-center md:py-12  w-full max-md:px-2">
      <div className="relative max-w-7xl w-full min-h-[50vh] rounded-xl overflow-hidden mt-8">
        {/* Header with countdown */}
        <header className="header-section ">
          <div className="main-header text-white text-start">
            আপনার দাম্পত্য জীবন আরও পূর্ণ করুন আপনি কি চান আপনার দাম্পত্য জীবনকে আরও পরিপূর্ণ, গভীর
            ও সুখময় করে তুলতে? এবার বিজ্ঞানের আলোকে জানুন — কীভাবে শারীরিক ও মানসিকভাবে সুস্থ থেকে
            গড়ে তুলবেন এক পরিপূর্ণ ঘনিষ্ঠ সম্পর্ক। এই ই-বুকে পাবেন: ✓ ঘনিষ্ঠ সম্পর্কের পেছনের
            বাস্তব বিজ্ঞান ✓ শারীরবৃত্তীয় ব্যাখ্যা এবং সমাধান ✓ মানসিক সামঞ্জস্য রক্ষার উপায় ✓
            দীর্ঘস্থায়ী সুখের জন্য বাস্তব কৌশল
          </div>
        </header>
      </div>
      <div>
        🔬 বৈজ্ঞানিক পদ্ধতি চিকিৎসা বিশেষজ্ঞদের দ্বারা যাচাইকৃত প্রমাণভিত্তিক তথ্য 💬 সহজ ভাষায়
        লেখা জটিল বিষয় সহজভাবে বোঝানো হয়েছে 🎯 ব্যবহারিক সমাধান প্রতিটি সমস্যার বাস্তব সমাধান
        দেওয়া আছে
      </div>
    </section>
  )
}
